src/Catalogs/удалитть_Проекты/удалитть_Проекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>удалитть_Проекты</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПроекта</name>
    <type>
      <types>CatalogRef.ТипыПроектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПлановая</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПлановая</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоставПроекта</name>
    <attributes>
      <name>ЭтапПроекта</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.Договоры</types>
      </type>
    </attributes>
    <attributes>
      <name>ПлановаяДлительность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИзмерениеДлительности</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачалаПлановая</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияПлановая</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтветственныйИсполнитель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗависимостиЭтапов</name>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗависимыйЭтап</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/удалитть_Проекты/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	мин_ДатаНачалаПлановая     = Дата(1,1,1);
	макс_ДатаОкончанияПлановая = Дата(1,1,1);
	
	Для Каждого СтрокаТаблицы Из СоставПроекта Цикл
		
		Если мин_ДатаНачалаПлановая = Дата(1,1,1) ИЛИ мин_ДатаНачалаПлановая > СтрокаТаблицы.ДатаНачалаПлановая Тогда
			мин_ДатаНачалаПлановая = СтрокаТаблицы.ДатаНачалаПлановая;
		КонецЕсли;
		
		Если макс_ДатаОкончанияПлановая < СтрокаТаблицы.ДатаОкончанияПлановая Тогда
			макс_ДатаОкончанияПлановая = СтрокаТаблицы.ДатаОкончанияПлановая;
		КонецЕсли;
		
	КонецЦикла;  // Для Каждого СтрокаТаблицы Из СоставПроекта Цикл
	
	ДатаНачалаПлановая    = мин_ДатаНачалаПлановая;
	ДатаОкончанияПлановая = макс_ДатаОкончанияПлановая;	
	
КонецПроцедуры  // ПередЗаписью(Отказ)
